In [1]:
import pandas as pd
import numpy as np
import statistics as stats
import pandas as pd
import numpy as np
import statistics as stats

import warnings
warnings.filterwarnings('ignore')

import pylab as plt
import seaborn as sns

# Cleaning old_HDD

Importamos el dataframe del csv language.csv

Observamos si tiene: 
 - Duplicados
 - Nulos

In [2]:
old = pd.read_csv('../data/old_HDD.csv', encoding = 'latin1')

In [3]:
old.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [4]:
old.duplicated().any()

False

In [5]:
old.isnull().any()

first_name      False
last_name       False
title           False
release_year    False
category_id     False
dtype: bool

In [6]:
old.count()

first_name      1000
last_name       1000
title           1000
release_year    1000
category_id     1000
dtype: int64

In [7]:
old['release_year'].nunique() == 1

True

- Los valores de la columna 'release_year' son Ãºnicos, por lo que voy a eliminar esta columna.

In [9]:
old = old.drop(['release_year'], axis=1)

In [10]:
old.columns

Index(['first_name', 'last_name', 'title', 'category_id'], dtype='object')

In [11]:
old = old.rename(columns = {'first_name': 'Name', 'last_name': 'Last_Name', 'title': 'Title'})

In [12]:
old['Name_complete'] = old['Name'] + ' ' + old['Last_Name']

In [13]:
old = old.drop(['Name', 'Last_Name'], axis=1)

In [14]:
old.head()

                   Title  category_id     Name_complete
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS
2            ANGELS LIFE           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS
4          CHEAPER CLYDE           14  PENELOPE GUINESS

In [15]:
len(old['Title'].duplicated())

1000

In [16]:
old['Title'].value_counts()

Title
BOONDOCK BALLROOM     6
FLASH WARS            5
STRANGER STRANGERS    5
OKLAHOMA JUMANJI      5
CHITTY LOCK           5
                     ..
FLYING HOOK           1
EGYPT TENENBAUMS      1
BUTCH PANTHER         1
TYCOON GATHERING      1
EXORCIST STING        1
Name: count, Length: 614, dtype: int64

In [22]:
# hay duplicados en los nombres de los tÃ­tulos porque mÃ¡s de un 'actor', estÃ¡ en un mismo 'Title'

- Le voy a poner un Ã­ndice al dataframe 'old'. 
- Esto me facilitarÃ¡ su uso posterior en SQL

In [23]:
old['old_id'] = range(1, len(old)+1)

In [24]:
old.head()

                   Title  category_id     Name_complete  old_id
0       ACADEMY DINOSAUR            6  PENELOPE GUINESS       1
1   ANACONDA CONFESSIONS            2  PENELOPE GUINESS       2
2            ANGELS LIFE           13  PENELOPE GUINESS       3
3  BULWORTH COMMANDMENTS           10  PENELOPE GUINESS       4
4          CHEAPER CLYDE           14  PENELOPE GUINESS       5

In [25]:
column_order = ['old_id', 'Title', 'Name_complete', 'category_id']

In [26]:
old = old.reindex(columns=column_order)

In [27]:
old.head()

   old_id                  Title     Name_complete  category_id
0       1       ACADEMY DINOSAUR  PENELOPE GUINESS            6
1       2   ANACONDA CONFESSIONS  PENELOPE GUINESS            2
2       3            ANGELS LIFE  PENELOPE GUINESS           13
3       4  BULWORTH COMMANDMENTS  PENELOPE GUINESS           10
4       5          CHEAPER CLYDE  PENELOPE GUINESS           14

In [28]:
old = old.set_index('old_id')

In [ ]:

merged_df = pd.merge(old_df, actor_df, on='Name_complete')

# Seleccionar las columnas que deseas mantener en la tabla resultante y renombrarlas segÃºn sea necesario

old_actor_df = merged_df[['Title', 'Name_complete', 'category_id', 'Actor_id']]
old_actor_df = old_actor_df.rename(columns={'Actor_id': 'actor_id'})

# Imprimir